app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comments_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Victor"], ["body", "Hello from ExpressJS"], ["article_id", 1], ["created_at", "2023-06-14 11:57:03.608263"], ["updated_at", "2023-06-14 11:57:03.608263"]]